app/views/posts/index.html.erb

SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 38]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 43]]
---
       <div class="card-like">
         <% if post.likes.length > 0 %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                 <% end %>
                 <% existing_like = post.likes.find{ |like| like.user_id == current_user.id } %>