app/controllers/friendships_controller.rb

  def create
    @friendship = Friendship.create(user_id: current_user.id, friend_id: params[:id])
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["created_at", "2019-04-04 10:07:35.885983"], ["updated_at", "2019-04-04 10:07:35.885983"]]