app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 36], ["user_id", 7], ["created_at", "2019-04-03 11:07:21.454940"], ["updated_at", "2019-04-03 11:07:21.454940"]]
---
  def create
    @like = Like.create(user_id: current_user.id, post_id: params[:post_id])

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 2]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    Like.find_by(id: params[:id]).destroy