app/controllers/posts_controller.rb

INSERT INTO "posts" ("message", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "higfgi;asglg"], ["created_at", "2019-04-02 10:45:19.639307"], ["updated_at", "2019-04-02 10:45:19.639307"], ["user_id", 7]]
---
  def create
    @post = Post.create(post_params.merge(user_id: current_user.id))

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (7, 5, 11, 10)
---
  def index
    @posts = Post.includes(:user).all.order('created_at DESC')

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "posts" SET "message" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["message", "Hii, edited"], ["updated_at", "2019-04-02 12:47:30.551028"], ["id", 26]]
---
  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 21]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def destroy
    @post = Post.find_by(id: params[:id]).destroy